Repository: Banananatwin/CrypTool-2
Catalog: CrypPlugins/BaconCipher/Properties/Resources.*.resx
Languages: ru, zh_cn

source: Alphabet
ru: Алфавит
zh_cn: 字母表

# AlphabetTooLong
source: The given alphabet is too long. Please activate dynamic length or provide a alphabet with less than 32 chars.
ru: Указанный алфавит слишком длинный. Пожалуйста, включите динамическую длину или укажите алфавит, содержащий менее 32 символов.
zh_cn: 指定的字母表太长了。请启用动态长度或指定一个少于32个字符的字母。

# AlphabetTooltip
source: Alphabet used by the Bacon cipher.
ru: Алфавит, используемый беконным шифром.
zh_cn: 培根密码所使用的字母。

# BaconCipher
source: Baconian cipher
ru: Шифр бекона
zh_cn: 培根密码

# BaconTooltip
source: A steganography method by Francis Bacon.
ru: Метод стеганографии Фрэнсиса Бэкона.
zh_cn: 弗朗西斯-培根的一种隐写术方法。

# CharAlreadyMapped
source: The alphabet contains duplicate chars.
ru: Алфавит содержит дублирующие символы.
zh_cn: 字母表包含重复的字符。

# CharCouldNotBeDecoded
source: Could not decode character "{0}".
ru: Не удалось декодировать символ "{0}".
zh_cn: 无法解码字符"{0}"。

# CodeLength
source: Length
ru: Длина
zh_cn: 长度

# CodeLengthCaption
source: Code word length
ru: Длина кодового слова
zh_cn: 代码字长

# CodeLengthToolTip
source: Determines the static length of the codeword.
ru: Определяет статическую длину кодового слова.
zh_cn: 确定码字的静态长度。

# CodeNotMappable
source: Could not fully decode since '{tempCode}' is not part of the mapping.
ru: Не удалось полностью расшифровать текст шифра, потому что '{tempCode}' не является частью отображения.
zh_cn: 无法完全解码密码文本，因为'{tempCode}'不是映射的一部分。

# DynamicCodeLengthCaption
source: Dynamic code word length
ru: Длина слова динамического кода
zh_cn: 动态代码字长

# DynamicCodeLengthToolTip
source: If dynamic code word length is enabled, only as many bits are used for encoding as are necessary for the size of the alphabet. Otherwise, a fixed size of 5 bits is used for encoding.
ru: Если включено динамическое кодирование, для кодирования используется только столько битов, сколько необходимо для размера алфавита. В противном случае для кодирования используется фиксированный размер в 5 бит.
zh_cn: 如果启用了动态编码，只有字母表大小所需的比特才会被用于编码。否则，将使用5比特的固定大小进行编码。

# ErrorSplitCipherAlphabet
source: Could not parse ciphertext alphabet input. Please use a seperator such as: "{0}". Stopping Execution!
ru: Не удалось обработать входной алфавит шифротекста. Пожалуйста, используйте разделитель, например: "{0}". Исполнение остановлено!
zh_cn: 无法处理输入的密文字母。请使用分隔符，如：。"{0}". 执行被停止了!

# IgnoringChar
source: Ignoring char "{0}" since it is not part of the alphabet.
ru: Символ "{0}" игнорируется, поскольку он не является частью алфавита.
zh_cn: 字符"{0}"被忽略了，因为它不是字母表的一部分。

# InputAlphabetCaption
source: External alphabet
ru: Внешний алфавит
zh_cn: 外部字母表

# InputAlphabetTooltip
source: External input for the alphabet used by the Bacon cipher.
ru: Внешний вход для алфавита, используемого шифром Бэкона.
zh_cn: 培根密码使用的字母表的外部输入。

# InputCipherCharsCaption
source: Ciphertext alphabet
ru: Алфавит шифротекста
zh_cn: 密文字母表

# InputCipherCharsTooltip
source: External input for custom ciphertext alphabet.
ru: Внешний вход для заданного пользователем алфавита шифротекста.
zh_cn: 用于用户定义的密码文本字母的外部输入。

# InputTextCaption
source: Text input
ru: Ввод текста
zh_cn: 文本输入

# InputTextTooltip
source: Input a string to be processed by the Bacon cipher
ru: Текст, который будет обрабатываться с помощью шифра Бэкона.
zh_cn: 要用培根密码处理的文本。

# Mode
source: Algorithm mode
ru: Режим
zh_cn: 模式

# ModeDecrypt
source: Decipher
ru: Расшифровать
zh_cn: 解密

# ModeEncrypt
source: Encipher
ru: Зашифровать
zh_cn: 加密

# ModeTooltip
source: Determine whether the component is in encrypt or decrypt mode.
ru: Определяет, используется ли компонент для шифрования или дешифрования.
zh_cn: 决定该组件是用于加密还是解密。

# OutputModeBinary
source: Binary
ru: Бинарные
zh_cn: 二进制

# OutputModeCaption
source: Output mode
ru: Режим вывода
zh_cn: 输出模式

# OutputModeExternalInput
source: External ciphertext alphabet
ru: Алфавит внешнего шифротекста
zh_cn: 外部密码文本的字母表

# OutputModeRandomChar
source: Random chars
ru: Случайные персонажи
zh_cn: 随机人物

# OutputModeToolTip
source: Specifies how the generated code should be output.
ru: Указывает, как должен быть выведен сгенерированный код.
zh_cn: 指定生成的代码应如何输出。

# OutputTextCaption
source: Text output
ru: Вывод текста
zh_cn: 文本输出

# OutputTextTooltip
source: Text after being processed by the Bacon cipher.
ru: Текст после его обработки шифром Бэкона
zh_cn: 用培根密码处理后的文本
